### LIMIT

**This is used to limit the number of records fetched upon query**
Syntax : SELECT columns1, columns2, columnN
         FROM table_name
         LIMIT [no of rows]

In [2]:
import sqlite3
conn = sqlite3.connect('../example.db')
cursor = conn.cursor()

In [3]:
cursor.execute('''SELECT * FROM EMPLOYEE''')
conn.commit()

result4 = cursor.fetchall()
print(result4)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0, 'I like what I do'), ('Kolapo', 'Joshua', 40, 'M', 7000.0, 'I am a singer'), ('Sarmista', 'Sharma', 26, 'F', 10000.0, 'I was made in the moon')]

In [4]:
cursor.execute('''SELECT * FROM EMPLOYEE LIMIT 2''')
conn.commit()

result4 = cursor.fetchall()
print(result4)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0, 'I like what I do'), ('Kolapo', 'Joshua', 40, 'M', 7000.0, 'I am a singer')]

In [5]:
cursor.execute('''SELECT * FROM EMPLOYEE WHERE SEX='F' ''')
conn.commit()

result4 = cursor.fetchall()
print(result4)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0, 'I like what I do'), ('Sarmista', 'Sharma', 26, 'F', 10000.0, 'I was made in the moon')]

In [6]:
cursor.execute('''SELECT * FROM EMPLOYEE WHERE SEX='F' LIMIT 1 ''')
conn.commit()

result4 = cursor.fetchall()
print(result4)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0, 'I like what I do')]

### JOIN

In [21]:
#Droping EMPLOYEE table if already exists.
cursor.execute("DROP TABLE IF EXISTS ADMIN")


#Creating table as per requirement
sql ='''CREATE TABLE ADMIN(
         FIRST_NAME CHAR(20) NOT NULL,
         LAST_NAME CHAR(20),
         MARITAL_STATUS BOOLEAN,
         SALARY FLOAT,
         RETIREMENT_YEAR INT(4),
         STAKE INT
         )
    '''
cursor.execute(sql)
print("Table created successfully........")
conn.commit()

Table created successfully........

In [22]:
cursor.execute("""SELECT name FROM sqlite_master 
    WHERE type='table';""")

conn.commit()

result6 = cursor.fetchall()
print(result6)

[('EMPLOYEE',), ('ADMIN',)]

In [24]:
cursor.execute('''INSERT INTO ADMIN(FIRST_NAME, LAST_NAME,
 MARITAL_STATUS, SALARY,RETIREMENT_YEAR, STAKE) VALUES ('Vinay','Christy', 'TRUE', 30000,2028, '10')''')

cursor.execute('''INSERT INTO ADMIN(FIRST_NAME, LAST_NAME,
 MARITAL_STATUS, SALARY,RETIREMENT_YEAR, STAKE) VALUES ('Sarmista','Sharma', 'FALSE',  '90000','2038', '20')''')

cursor.execute('''INSERT INTO ADMIN(FIRST_NAME, LAST_NAME,
 MARITAL_STATUS, SALARY,RETIREMENT_YEAR, STAKE) VALUES ('Ramya','Rama Priya', 'TRUE', 50000, 2060, '30')''')

# Commit your changes in the database
conn.commit()

In [25]:
cursor.execute('''SELECT * FROM ADMIN''')
conn.commit()

result4 = cursor.fetchall()
print(result4)

[('Vinay', 'Christy', 'TRUE', 30000.0, 2028, 10), ('Sarmista', 'Sharma', 'FALSE', 90000.0, 2038, 20), ('Ramya', 'Rama Priya', 'TRUE', 50000.0, 2060, 30)]

**How do we use JOIN?**

In [28]:
cursor.execute('''SELECT EMPLOYEE.FIRST_NAME, EMPLOYEE.AGE, ADMIN.MARITAL_STATUS, ADMIN.RETIREMENT_YEAR 
                  FROM EMPLOYEE
                  INNER JOIN ADMIN ON EMPLOYEE.FIRST_NAME = ADMIN.FIRST_NAME''')
conn.commit()

result4 = cursor.fetchall()
print(result4)

[('Ramya', 27, 'TRUE', 2060), ('Sarmista', 26, 'FALSE', 2038)]

**Take Note: There are Four(4) kinds of joins**

!['Join Types'](join_img.png)

#### INNER JOIN
**The INNER JOIN keyword selects all rows from both the tables as long as the condition is satisfied.**

SELECT table1.column1,table1.column2,table2.column1,....
FROM table1 
INNER JOIN table2
ON table1.matching_column = table2.matching_column;

**The example we have avove**

#### LEFT JOIN
This join returns all the rows of the table on the left side of the join and matches rows for the table on the right side of the join. For the rows for which there is no matching row on the right side, the result-set will contain null

SELECT table1.column1,table1.column2,table2.column1,....
FROM table1 
LEFT JOIN table2
ON table1.matching_column = table2.matching_column;

In [31]:
cursor.execute('''SELECT EMPLOYEE.FIRST_NAME, EMPLOYEE.AGE, ADMIN.MARITAL_STATUS, ADMIN.RETIREMENT_YEAR 
                  FROM EMPLOYEE
                  LEFT JOIN ADMIN ON EMPLOYEE.FIRST_NAME = ADMIN.FIRST_NAME''')
conn.commit()

result4 = cursor.fetchall()
print(result4)

[('Ramya', 27, 'TRUE', 2060), ('Kolapo', 40, None, None), ('Sarmista', 26, 'FALSE', 2038)]

#### RIGHT JOIN
RIGHT JOIN is similar to LEFT JOIN. This join returns all the rows of the table on the right side of the join and matching rows for the table on the left side of the join. For the rows for which there is no matching row on the left side, the result-set will contain null.

SELECT table1.column1,table1.column2,table2.column1,....
FROM table1 
RIGHT JOIN table2
ON table1.matching_column = table2.matching_column;

In [32]:
cursor.execute('''SELECT EMPLOYEE.FIRST_NAME, EMPLOYEE.AGE, ADMIN.MARITAL_STATUS, ADMIN.RETIREMENT_YEAR 
                  FROM EMPLOYEE
                  RIGHT JOIN ADMIN ON EMPLOYEE.FIRST_NAME = ADMIN.FIRST_NAME''')
conn.commit()

result4 = cursor.fetchall()
print(result4)

[('Ramya', 27, 'TRUE', 2060), ('Sarmista', 26, 'FALSE', 2038), (None, None, 'TRUE', 2028)]

#### FULL JOIN
FULL JOIN creates the result-set by combining results of both LEFT JOIN and RIGHT JOIN. The result-set will contain all the rows from both tables. For the rows for which there is no matching, the result-set will contain NULL values.

SELECT table1.column1,table1.column2,table2.column1,....
FROM table1 
FULL JOIN table2
ON table1.matching_column = table2.matching_column;

In [33]:
cursor.execute('''SELECT EMPLOYEE.FIRST_NAME, EMPLOYEE.AGE, ADMIN.MARITAL_STATUS, ADMIN.RETIREMENT_YEAR 
                  FROM EMPLOYEE
                  FULL JOIN ADMIN ON EMPLOYEE.FIRST_NAME = ADMIN.FIRST_NAME''')
conn.commit()

result4 = cursor.fetchall()
print(result4)

[('Ramya', 27, 'TRUE', 2060), ('Kolapo', 40, None, None), ('Sarmista', 26, 'FALSE', 2038), (None, None, 'TRUE', 2028)]

### Learn how to convert a dataframe to table and save on an SQL table

In [35]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('../example.db')
cursor = conn.cursor()

In [36]:
cursor = conn.cursor()

# Create you virtual db as usual
cursor.execute('''CREATE TABLE Product_Data (
                    Member_number INTEGER,
                    ItemDescription TEXT,
                    Date DATE
                )''')
conn.commit()

In [37]:
df = pd.read_csv('../product_db.csv')

In [38]:
df.head()

   Member_number        Date   itemDescription
0           1808  21-07-2015    tropical fruit
1           2552  05-01-2015        whole milk
2           2300  19-09-2015         pip fruit
3           1187  12-12-2015  other vegetables
4           3037  01-02-2015        whole milk

In [39]:
# Loading the Pandas DataFrame into the table created 
df.to_sql('Product_Data', conn, if_exists='replace', index=False)

38765

In [40]:
## Let's test
sql1 = '''
    SELECT COUNT(DISTINCT(itemDescription)) FROM Product_Data
'''
cursor.execute(sql1)
conn.commit()
result1 = cursor.fetchall()
print(result1)

[(167,)]